// 项目：前端+后端代码

// 域名：去万网买；域名的作用便于用户记住和使用网站；在没有域名的时候需要使用IP，IP是一串数字的组合如百度61.135.169.125:443

// ? 谁来记着www.baidu.com 就是 61.135.169.125 ip；
// DNS服务: Domain-Name-System DNS由DNS服务器提供，它负责把域名解析成IP地址；

// 服务器：就是一台高性能的电脑，服务器和普通电脑不同在于服务器追求稳定，不能总出问题；我们项目的代码要想给用户提供服务，要把代码部署到服务器上；每个服务器都有一个IP地址，并且靠这个IP地址连接网络给外界提供服务；

// ftp上传：File Transfer Protocol 把咱们代码和其他文件上传到服务器上；（有很多的FTP工具，如FileZilla、IDE也带、写脚本也可以上传）；


// 端口：服务器不仅可以提供一个服务，一个服务器可以分成若干这个小房间，一个小房间对应一个编号，每一个小房间都可以提供一个服务；编号的取值范围是：0-65535；一般不会都开放，一般只开常用的：http协议默认使用80端口，https默认使用443端口，数据库默认使用3306；

// webstorm或者vscode-live-server可以在本机启动一个服务；所以本机又充当服务器的角色，在我的电脑上访问 localhost:63342/xxx/xx 此时我的电脑又充当了客户端的角色。所以此时我的电脑又是客户端又是服务器；此时不需要互联网就能访问；

// 搜索爬虫：做搜索的公司有一个程序，每天都去各大网站把热词都拿回来放到自己的搜索库里面；此外还收集网站上的关键词：TDK 也放到搜索库中。当我们进到百度搜索东西时，它会把我们输入的关键词和它搜索库中的东西比较，把它觉得相似的给我们；

// http: 协议





