/*
* github: www.github.com 项目托管平台
* git: 版本管理工具（代码管理工具）
* */

// 1. 建立github账户
// 2. 创建一个仓库(远程仓库)
// 3. 把远程仓库克隆到本地
  // 3.1 赋值git仓库地址 比如：https://github.com/handsomeBingo/201905js.git
  // 3.2 进入到本地目录中（尽量不要用中文命名文件夹）右键 git bash here 打开命令行
  // 3.3 在命令行中键入命令： git clone 仓库地址  回车

// 4. 本地文件夹关联远程仓库
// 4.1 在本地文件夹中 右键打开 git bash here
// 4.2 键入命令：git init 把本地文件夹初始化成一个git仓库
// 4.3 键入命令：git remote add origin 项目地址
// 4.4 键入命令：git remote -v

// 5. 提交一个版本（上传文件到远程仓库）
// 提交版本需要经历git的三个区
// 工作区：本地文件夹
// 暂存区：缓存区（缓存你对文件的修改）
// 历史区：生成一个历史版本

// git status 查看本地仓库的状态
// 文件是红色：这些文件处于工作区；
// 添加到暂存区：git add . (. 是全部:表示把红色的都添加到暂存区，如果我们有以下文件不想添加到暂存区，使用git add 文件名 逐个把我们想添加的文件添加到暂存区)
// 









